{
  "_name_or_path": "microsoft/dit-base",
  "add_fpn": false,
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "id",
    "1": "idObcy",
    "2": "inne",
    "3": "paszport",
    "4": "paszportObcy",
    "5": "prawoJazdy",
    "6": "prawoJazdyObce"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "id": 0,
    "idObcy": 1,
    "inne": 2,
    "paszport": 3,
    "paszportObcy": 4,
    "prawoJazdy": 5,
    "prawoJazdyObce": 6
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_features": [
    "stage3",
    "stage5",
    "stage7",
    "stage11"
  ],
  "out_indices": [
    3,
    5,
    7,
    11
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "single_label_classification",
  "reshape_hidden_states": true,
  "semantic_loss_ignore_index": 255,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7",
    "stage8",
    "stage9",
    "stage10",
    "stage11",
    "stage12"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "use_absolute_position_embeddings": true,
  "use_auxiliary_head": true,
  "use_mask_token": true,
  "use_mean_pooling": true,
  "use_relative_position_bias": false,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}
